# GraphicsStyleType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GraphicsStyle..::..GraphicsStyleType Property
GraphicsStyle Class See Also
---
The graphics style type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GraphicsStyleType GraphicsStyleType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GraphicsStyleType As GraphicsStyleType
	Get
```

Visual C++
---
```text
public:
property GraphicsStyleType GraphicsStyleType {
	GraphicsStyleType get ();
}
```

# See Also
GraphicsStyle Class
Autodesk.Revit.DB Namespace